src/DataProcessors/ЗаменаСтавокНДС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<DataProcessor>
		<Properties>
			<Name>ЗаменаСтавокНДС</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

src/Catalogs/ДоговорыМеждуОрганизациями.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ДоговорыМеждуОрганизациями</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<BasedOn>
				<xr:Item>Catalog.СоглашенияСКлиентами</xr:Item>
				<xr:Item>Catalog.СоглашенияСПоставщиками</xr:Item>
				<xr:Item>Catalog.Партнеры</xr:Item>
			</BasedOn>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>БанковскийСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчетаОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БанковскийСчетПолучателя</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчетаОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаВзаиморасчетов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончанияДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Менеджер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеДляПечати</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Номер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОрганизацияПолучатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПорядокРасчетов</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПорядокРасчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Согласован</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыДоговоровКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипДоговора</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыДоговоровМеждуОрганизациями</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаФинансовогоУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыФинансовогоУчетаРасчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяДвиженияДенежныхСредств</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДвиженияДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторПлатежа</Name>
					<Comment>Поле 22 "Код"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяДвиженияДенежныхСредствПолучателя</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДвиженияДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаправлениеДеятельности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НаправленияДеятельности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УстановленСрокОплаты</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокОплаты</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтавкаНДС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтавкиНДС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорСУчастникомГОЗ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГосударственныйКонтракт</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГосударственныеКонтракты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПлатежиПо275ФЗ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипПлатежаФЗ275</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаПрибыли</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаНеотрицательная</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаНеотрицательная</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОплатаРасходовПоТарифамСГосрегулированием</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыполненыОбязательстваПоДоговоруГОЗ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИностранныйИсполнительВУтвержденномПеречнеГОЗ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаФинансовогоУчетаПолучателя</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыФинансовогоУчетаРасчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторГосКонтракта</Name>
					<Comment>Идентификатор государственного контракта, договора (соглашения)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьУникальныйНомерВалютногоКонтроля</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>22</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НалогообложениеНДС</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыНалогообложенияНДС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗакупкаПодДеятельность</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыНалогообложенияНДС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НалогообложениеНДСОпределяетсяВДокументе</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗакупкаПодДеятельностьОпределяетсяВДокументе</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодРаздел7ДекларацииНДС</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОплатаВВалюте</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантКурсаДоговора</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыКурсаДоговора</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПорядокЗачетаОплатНакладных</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПорядкиЗачетаОплатНакладных</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДоговорыСЗаказчиками</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДоговорСЗаказчиком</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ДоговорыМеждуОрганизациями</v8:Type>
								<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Процент</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПодтверждающиеДокументы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидДокумента</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номер</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>128</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Дата</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаНеотрицательная</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Файл</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ДоговорыМеждуОрганизациямиПрисоединенныеФайлы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/DataProcessors/ЗаменаСтавокНДС/Forms/ФормаОбработки/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не ЗначениеЗаполнено(СтранаРегистрации) Тогда
		СтранаРегистрации = Константы.ОсновнаяСтрана.Получить();
	КонецЕсли;
	
	ЭтоУТ = ПолучитьФункциональнуюОпцию("УправлениеТорговлей");
	Элементы.ГруппаДоговорыАренды.Видимость = Не ЭтоУТ;
	Элементы.ПерейтиДокументы.Видимость     = Не ЭтоУТ;
	Элементы.ПредупреждениеАренда.Видимость = Не ЭтоУТ;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	НачатьОбновлениеФормы();
	
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	Если Не ЗначениеЗаполнено(СтранаРегистрации) Тогда
		СтранаРегистрации = Константы.ОсновнаяСтрана.Получить();
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ТекущаяСтавкаПриИзменении(Элемент)
	
	НачатьОбновлениеФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодПриИзменении(Элемент)
	
	НачатьОбновлениеФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура СтранаРегистрацииПриИзменении(Элемент)
	
	НачатьОбновлениеФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ДанныеНоменклатураОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	СтавкаНДС = ДанныеНоменклатураОбработкаНавигационнойСсылкиНаСервере(НавигационнаяСсылкаФорматированнойСтроки);
	
	ПараметрыФормы = Новый Структура();
	ПараметрыФормы.Вставить("Страна",    СтранаРегистрации);
	ПараметрыФормы.Вставить("СтавкаНДС", СтавкаНДС);
	ПараметрыФормы.Вставить("Период",    Период);
	
	ОткрытьФорму("РегистрСведений.СтавкиНДСНоменклатуры.Форма.РабочееМесто", ПараметрыФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура ДанныеВидыНоменклатурыОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ОткрытьФормуСправочника(НавигационнаяСсылкаФорматированнойСтроки, "Справочник.ВидыНоменклатуры.Форма.ФормаСписка");
	
КонецПроцедуры

&НаКлиенте
Процедура ДанныеДоговорыКонтрагентовОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ОткрытьФормуСправочника(НавигационнаяСсылкаФорматированнойСтроки, "Справочник.ДоговорыКонтрагентов.Форма.ФормаСписка", Истина);
	
КонецПроцедуры 

&НаКлиенте
Процедура ДанныеДоговорыМеждуорганизациямиОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ОткрытьФормуСправочника(НавигационнаяСсылкаФорматированнойСтроки, "Справочник.ДоговорыМеждуОрганизациями.Форма.ФормаСписка", Истина);

КонецПроцедуры

&НаКлиенте
Процедура ДанныеДоговорыАрендыОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ОткрытьФормуСправочникаДоговорыАренды(НавигационнаяСсылкаФорматированнойСтроки);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Обновить(Команда)
	
	НачатьОбновлениеФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаменитьВезде(Команда)
	
	Если Не ПроверитьЗаполнениеФормы(Истина) Тогда
		Возврат;
	КонецЕсли;
	
	СписокСправочников = Новый СписокЗначений;
	СписокСправочников.Добавить("Номенклатура");
	СписокСправочников.Добавить("ВидыНоменклатуры");
	СписокСправочников.Добавить("ДоговорыКонтрагентов");
	СписокСправочников.Добавить("ДоговорыМеждуОрганизациями");
	
	ДлительнаяОперация = НачатьЗаменуСтавкиНаСервере(СписокСправочников);

	ОповещениеОЗавершении = Новый ОписаниеОповещения("ЗаменаСтавкиЗавершение", ЭтотОбъект);
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОповещениеОЗавершении, ПараметрыОжидания);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаменитьВВидеНоменклатуры(Команда)
	
	Если Не ПроверитьЗаполнениеФормы(Ложь) Тогда
		Возврат;
	КонецЕсли;
	
	СписокСправочников = Новый СписокЗначений;
	СписокСправочников.Добавить("ВидыНоменклатуры");
	
	ДлительнаяОперация = НачатьЗаменуСтавкиНаСервере(СписокСправочников);

	ОповещениеОЗавершении = Новый ОписаниеОповещения("ЗаменаСтавкиЗавершение", ЭтотОбъект);
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОповещениеОЗавершении, ПараметрыОжидания);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаменитьВНоменклатуре(Команда)
	
	Если Не ПроверитьЗаполнениеФормы(Истина) Тогда
		Возврат;
	КонецЕсли;
	
	СписокСправочников = Новый СписокЗначений;
	СписокСправочников.Добавить("Номенклатура");
	
	ДлительнаяОперация = НачатьЗаменуСтавкиНаСервере(СписокСправочников);

	ОповещениеОЗавершении = Новый ОписаниеОповещения("ЗаменаСтавкиЗавершение", ЭтотОбъект);
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОповещениеОЗавершении, ПараметрыОжидания);
	
КонецПроцедуры 

&НаКлиенте
Процедура ЗаменитьВДоговорахСКонтрагентами(Команда) 
	
	Если Не ПроверитьЗаполнениеФормы(Ложь) Тогда
		Возврат;
	КонецЕсли;
	
	СписокСправочников = Новый СписокЗначений;
	СписокСправочников.Добавить("ДоговорыКонтрагентов");
	
	ДлительнаяОперация = НачатьЗаменуСтавкиНаСервере(СписокСправочников);

	ОповещениеОЗавершении = Новый ОписаниеОповещения("ЗаменаСтавкиЗавершение", ЭтотОбъект);
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОповещениеОЗавершении, ПараметрыОжидания);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаменитьВДоговорахМеждуОрганизациями(Команда)
	
	Если Не ПроверитьЗаполнениеФормы(Ложь) Тогда
		Возврат;
	КонецЕсли;
	
	СписокСправочников = Новый СписокЗначений;
	СписокСправочников.Добавить("ДоговорыМеждуОрганизациями");
	
	ДлительнаяОперация = НачатьЗаменуСтавкиНаСервере(СписокСправочников);

	ОповещениеОЗавершении = Новый ОписаниеОповещения("ЗаменаСтавкиЗавершение", ЭтотОбъект);
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОповещениеОЗавершении, ПараметрыОжидания);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСписокДоговорыАренды(Команда)
	
	
	Возврат ; // В УТ не используется
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСписокДокументы(Команда)
	
	
	Возврат ; // В УТ не используется
	
КонецПроцедуры


#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура НачатьОбновлениеФормы()

	ДлительнаяОперация = НачатьОбновлениеФормыНаСервере();

	ОповещениеОЗавершении = Новый ОписаниеОповещения("ОбновлениеФормыЗавершение", ЭтотОбъект);
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОповещениеОЗавершении, ПараметрыОжидания);

КонецПроцедуры

&НаСервере
Функция НачатьОбновлениеФормыНаСервере()
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияФункции(УникальныйИдентификатор);
	
	ПараметрыПолученияДанных = Обработки.ЗаменаСтавокНДС.ПараметрыПолученияДанных();
	ПараметрыПолученияДанных.ТекущаяСтавка = ТекущаяСтавка;
	ПараметрыПолученияДанных.НоваяСтавка   = НоваяСтавка;
	ПараметрыПолученияДанных.Период        = Период;
	ПараметрыПолученияДанных.Страна        = СтранаРегистрации;
	
	ИмяФункции = "Обработки.ЗаменаСтавокНДС.ПолучениеДанныхПоСтавкахНДС";
	
	Возврат ДлительныеОперации.ВыполнитьФункцию(ПараметрыВыполнения,
		ИмяФункции, ПараметрыПолученияДанных);
	
КонецФункции

&НаКлиенте
Процедура ОбновлениеФормыЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Результат.Статус = "Ошибка" Тогда
		СтандартныеПодсистемыКлиент.ВывестиИнформациюОбОшибке(Результат.ИнформацияОбОшибке);
		Возврат;
	КонецЕсли;
	
	ДанныеСправочниковПоСтавкам = ПолучитьИзВременногоХранилища(Результат.АдресРезультата);
	УдалитьИзВременногоХранилища(Результат.АдресРезультата);
	
	СтрокаШаблона             = НСтр("ru = '%4 %1 - <a href = ""%2""> %3 </a>'");
	СтрокаШаблонаПервойСтроки = НСтр("ru = '%1 - <a href = ""%2""> %3 </a>'");
	Разделитель = ","; 
	ВыводитьКнопкуИзменитьВсе = Ложь;
	
	Для Каждого ТипСправочника Из ДанныеСправочниковПоСтавкам Цикл
		
		ИмяЭлементаУспешно = "Успешно" + ТипСправочника.Ключ;
		ЭтотОбъект[ИмяЭлементаУспешно] = Истина;
		ИмяЭлемента = "Группа"+ТипСправочника.Ключ;
		Массив = Новый Массив();
		
		Если ЗначениеЗаполнено(ТипСправочника.Значение) Тогда
			
			Элементы[ИмяЭлемента].Видимость = Истина;
			ВыводитьКнопкуИзменитьВсе = Истина;
			ПерваяСтрока = Истина;
			Для Каждого СтавкаНДС Из ТипСправочника.Значение Цикл
				Если ЗначениеЗаполнено(СтавкаНДС.СтавкаНДС) Тогда
					Если СтавкаНДС.СтавкаНДС = ТекущаяСтавка Тогда
						
						ЭтотОбъект[ИмяЭлементаУспешно] = Ложь;
						Если Не ТипСправочника.Ключ = "ДоговорыАренды" Тогда
							ИмяЭлемента = "Заменить"+ТипСправочника.Ключ;
							Элементы[ИмяЭлемента].Заголовок = НСтр("ru = 'Заменить ставку'") + " (" + СтавкаНДС.Количество+")";
						КонецЕсли;
						
					КонецЕсли;
					СтрокаСДаннымиПоставке = СтроковыеФункцииКлиент.ФорматированнаяСтрока(?(ПерваяСтрока, СтрокаШаблонаПервойСтроки, СтрокаШаблона),
																		Строка(СтавкаНДС.СтавкаНДС), СтавкаНДС.УИД, СтавкаНДС.Количество, Разделитель);
					
					Массив.Добавить(СтрокаСДаннымиПоставке);
					ИмяЭлемента = "Данные"+ТипСправочника.Ключ;
					Элементы[ИмяЭлемента].Заголовок = Новый ФорматированнаяСтрока(Массив);
					ПерваяСтрока = Ложь;
					
				КонецЕсли;
			КонецЦикла;
			
		Иначе
			Элементы[ИмяЭлемента].Видимость = Ложь;
		КонецЕсли;
		
	КонецЦикла;
	
	Элементы.ФормаЗаменитьВезде.Доступность = ВыводитьКнопкуИзменитьВсе;
	УстановитьВидимость(ДанныеСправочниковПоСтавкам);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаменаСтавкиЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Результат.Статус = "Ошибка" Тогда
		СтандартныеПодсистемыКлиент.ВывестиИнформациюОбОшибке(Результат.ИнформацияОбОшибке);
		Возврат;
	КонецЕсли;
	
	НачатьОбновлениеФормы();
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ДанныеНоменклатураОбработкаНавигационнойСсылкиНаСервере(УИД)
	
	Возврат Справочники.СтавкиНДС.ПолучитьСсылку(Новый УникальныйИдентификатор(УИД));
	
КонецФункции

&НаСервере
Процедура УстановитьВидимость(АнализируемыеСправочники)
	
	Для Каждого Справочник Из АнализируемыеСправочники Цикл
		ИмяЭлементаУспешно = "Успешно" + Справочник.Ключ;
		Элементы["ДекорацияЗаменаСтавок" + Справочник.Ключ].Видимость = Не ЭтотОбъект[ИмяЭлементаУспешно];
		Элементы["ДекорацияЗаменаСтавокУспешно" + Справочник.Ключ].Видимость = ЭтотОбъект[ИмяЭлементаУспешно];
		Если Справочник.Ключ <> "ДоговорыАренды" Тогда
			Элементы["Заменить" + Справочник.Ключ].Доступность = Не ЭтотОбъект[ИмяЭлементаУспешно];
			Если ЭтотОбъект[ИмяЭлементаУспешно] Тогда
				ИмяЭлемента = "Заменить"+Справочник.Ключ;
				Элементы[ИмяЭлемента].Заголовок = НСтр("ru = 'Заменить ставку'") + " (" + 0 +")";
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуСправочника(УИД, ИмяФормы, ОтборПоПериоду = Ложь)
	
	СтавкаНДС = ДанныеНоменклатураОбработкаНавигационнойСсылкиНаСервере(УИД);
	
	ПараметрыФормы = Новый Структура();
	ПараметрыФормы.Вставить("СтавкаНДС", СтавкаНДС);
	Если ОтборПоПериоду Тогда
		ПараметрыФормы.Вставить("Статус", ПредопределенноеЗначение("Перечисление.СтатусыДоговоровКонтрагентов.Закрыт"));
		ПараметрыФормы.Вставить("ВидСравненияСтатуса", ВидСравненияКомпоновкиДанных.НеРавно);
		ДоступныеПериоды = Новый СписокЗначений();
		ДоступныеПериоды.Добавить(Дата(1,1,1));
		ДоступныеПериоды.Добавить(Период);
		ПараметрыФормы.Вставить("ДатаОкончанияДействия", ДоступныеПериоды);
		ПараметрыФормы.Вставить("ВидСравненияДаты", ВидСравненияКомпоновкиДанных.ВСписке);
	КонецЕсли;
	
	ОткрытьФорму(ИмяФормы, ПараметрыФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуСправочникаДоговорыАренды(УИД)
	
	
КонецПроцедуры


&НаСервере
Функция НачатьЗаменуСтавкиНаСервере(СписокСправочников)
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияФункции(УникальныйИдентификатор);
	
	ПараметрыПолученияДанных = Обработки.ЗаменаСтавокНДС.ПараметрыПолученияДанных();
	ПараметрыПолученияДанных.ТекущаяСтавка      = ТекущаяСтавка;
	ПараметрыПолученияДанных.НоваяСтавка        = НоваяСтавка;
	ПараметрыПолученияДанных.Период             = Период;
	ПараметрыПолученияДанных.Страна             = СтранаРегистрации;
	ПараметрыПолученияДанных.СписокСправочников = СписокСправочников;
	
	ИмяФункции = "УчетНДСУП.ЗаменитьСтавкуНДС";
	
	Возврат ДлительныеОперации.ВыполнитьПроцедуру(ПараметрыВыполнения,
		ИмяФункции, ПараметрыПолученияДанных);
	
КонецФункции

&НаКлиенте
Функция ПроверитьЗаполнениеФормы(ПроверятьПериод)
	
	ОчиститьСообщения();
	
	ФормаЗаполнена = Истина;
	
	Если Не ЗначениеЗаполнено(ТекущаяСтавка) Тогда
		ФормаЗаполнена = Ложь;
		ТекстОшибки = НСтр("ru = 'Поле ""Ставка"" не заполнено'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(
			ТекстОшибки,, "ТекущаяСтавка");
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(НоваяСтавка) Тогда
		ФормаЗаполнена = Ложь;
		ТекстОшибки = НСтр("ru = 'Поле ""Новая ставка"" не заполнено'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(
			ТекстОшибки,, "НоваяСтавка");
	КонецЕсли;
	
	Если ПроверятьПериод И Не ЗначениеЗаполнено(Период) Тогда
		ФормаЗаполнена = Ложь;
		ТекстОшибки = НСтр("ru = 'Поле ""Период"" не заполнено'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(
			ТекстОшибки,, "Период");

	КонецЕсли;
	
	Возврат ФормаЗаполнена;
	
КонецФункции

#КонецОбласти
